; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-4-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p0-2 - location
	p0-6 - location
	p0-11 - location
	p1-7 - location
	p1-8 - location
	p1-10 - location
	p2-0 - location
	p2-1 - location
	p3-0 - location
	p3-7 - location
	p4-1 - location
	p4-3 - location
	p5-3 - location
	p5-6 - location
	p6-4 - location
	p7-5 - location
	p8-9 - location
	p9-3 - location
	p11-1 - location
	p11-7 - location
	p11-10 - location
	)
	(:init
	(at driver1 s11)
	(at driver2 s7)
	(at driver3 s11)
	(at driver4 s7)
	(at driver5 s11)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s11)
	(empty truck2)
	(at truck3 s11)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at package1 s6)
	(at package2 s4)
	(at package3 s7)
	(at package4 s1)
	(at package5 s6)
	(at package6 s1)
	(at package7 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 39)
	(= (time-to-walk p0-2 s0) 39)
	(= (time-to-walk s2 p0-2) 47)
	(= (time-to-walk p0-2 s2) 47)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 66)
	(= (time-to-walk p0-6 s0) 66)
	(= (time-to-walk s6 p0-6) 39)
	(= (time-to-walk p0-6 s6) 39)
	(path s0 p0-11)
	(path p0-11 s0)
	(path s11 p0-11)
	(path p0-11 s11)
	(= (time-to-walk s0 p0-11) 40)
	(= (time-to-walk p0-11 s0) 40)
	(= (time-to-walk s11 p0-11) 5)
	(= (time-to-walk p0-11 s11) 5)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(= (time-to-walk s1 p1-7) 17)
	(= (time-to-walk p1-7 s1) 17)
	(= (time-to-walk s7 p1-7) 43)
	(= (time-to-walk p1-7 s7) 43)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(= (time-to-walk s1 p1-8) 70)
	(= (time-to-walk p1-8 s1) 70)
	(= (time-to-walk s8 p1-8) 30)
	(= (time-to-walk p1-8 s8) 30)
	(path s1 p1-10)
	(path p1-10 s1)
	(path s10 p1-10)
	(path p1-10 s10)
	(= (time-to-walk s1 p1-10) 94)
	(= (time-to-walk p1-10 s1) 94)
	(= (time-to-walk s10 p1-10) 76)
	(= (time-to-walk p1-10 s10) 76)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 50)
	(= (time-to-walk p2-1 s2) 50)
	(= (time-to-walk s1 p2-1) 32)
	(= (time-to-walk p2-1 s1) 32)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 80)
	(= (time-to-walk p3-0 s3) 80)
	(= (time-to-walk s0 p3-0) 71)
	(= (time-to-walk p3-0 s0) 71)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 95)
	(= (time-to-walk p3-7 s3) 95)
	(= (time-to-walk s7 p3-7) 46)
	(= (time-to-walk p3-7 s7) 46)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 22)
	(= (time-to-walk p4-1 s4) 22)
	(= (time-to-walk s1 p4-1) 8)
	(= (time-to-walk p4-1 s1) 8)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 5)
	(= (time-to-walk p4-3 s4) 5)
	(= (time-to-walk s3 p4-3) 90)
	(= (time-to-walk p4-3 s3) 90)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 58)
	(= (time-to-walk p5-3 s5) 58)
	(= (time-to-walk s3 p5-3) 23)
	(= (time-to-walk p5-3 s3) 23)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 33)
	(= (time-to-walk p5-6 s5) 33)
	(= (time-to-walk s6 p5-6) 70)
	(= (time-to-walk p5-6 s6) 70)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 37)
	(= (time-to-walk p6-4 s6) 37)
	(= (time-to-walk s4 p6-4) 92)
	(= (time-to-walk p6-4 s4) 92)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 95)
	(= (time-to-walk p7-5 s7) 95)
	(= (time-to-walk s5 p7-5) 89)
	(= (time-to-walk p7-5 s5) 89)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(= (time-to-walk s8 p8-9) 58)
	(= (time-to-walk p8-9 s8) 58)
	(= (time-to-walk s9 p8-9) 33)
	(= (time-to-walk p8-9 s9) 33)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(= (time-to-walk s9 p9-3) 36)
	(= (time-to-walk p9-3 s9) 36)
	(= (time-to-walk s3 p9-3) 23)
	(= (time-to-walk p9-3 s3) 23)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(= (time-to-walk s11 p11-1) 71)
	(= (time-to-walk p11-1 s11) 71)
	(= (time-to-walk s1 p11-1) 75)
	(= (time-to-walk p11-1 s1) 75)
	(path s11 p11-7)
	(path p11-7 s11)
	(path s7 p11-7)
	(path p11-7 s7)
	(= (time-to-walk s11 p11-7) 27)
	(= (time-to-walk p11-7 s11) 27)
	(= (time-to-walk s7 p11-7) 88)
	(= (time-to-walk p11-7 s7) 88)
	(path s11 p11-10)
	(path p11-10 s11)
	(path s10 p11-10)
	(path p11-10 s10)
	(= (time-to-walk s11 p11-10) 17)
	(= (time-to-walk p11-10 s11) 17)
	(= (time-to-walk s10 p11-10) 96)
	(= (time-to-walk p11-10 s10) 96)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 17)
	(= (time-to-drive s9 s0) 17)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 10)
	(= (time-to-drive s3 s1) 10)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 72)
	(= (time-to-drive s6 s1) 72)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 67)
	(= (time-to-drive s8 s1) 67)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 42)
	(= (time-to-drive s10 s1) 42)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 51)
	(= (time-to-drive s0 s2) 51)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 37)
	(= (time-to-drive s3 s2) 37)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 36)
	(= (time-to-drive s4 s2) 36)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 96)
	(= (time-to-drive s8 s2) 96)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 58)
	(= (time-to-drive s4 s3) 58)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 43)
	(= (time-to-drive s8 s3) 43)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 1)
	(= (time-to-drive s5 s4) 1)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 48)
	(= (time-to-drive s6 s4) 48)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 1)
	(= (time-to-drive s7 s4) 1)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 23)
	(= (time-to-drive s9 s4) 23)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 80)
	(= (time-to-drive s10 s4) 80)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 71)
	(= (time-to-drive s10 s5) 71)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 59)
	(= (time-to-drive s11 s5) 59)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 72)
	(= (time-to-drive s3 s7) 72)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 65)
	(= (time-to-drive s6 s7) 65)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 48)
	(= (time-to-drive s4 s8) 48)
	(link s8 s11)
	(link s11 s8)
	(= (time-to-drive s8 s11) 29)
	(= (time-to-drive s11 s8) 29)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 97)
	(= (time-to-drive s1 s9) 97)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 83)
	(= (time-to-drive s8 s9) 83)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 51)
	(= (time-to-drive s2 s10) 51)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 68)
	(= (time-to-drive s8 s10) 68)
	(link s10 s11)
	(link s11 s10)
	(= (time-to-drive s10 s11) 57)
	(= (time-to-drive s11 s10) 57)
	(link s11 s0)
	(link s0 s11)
	(= (time-to-drive s11 s0) 78)
	(= (time-to-drive s0 s11) 78)
	(link s11 s1)
	(link s1 s11)
	(= (time-to-drive s11 s1) 55)
	(= (time-to-drive s1 s11) 55)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 74)
	(= (time-to-drive s4 s11) 74)
	(link s11 s6)
	(link s6 s11)
	(= (time-to-drive s11 s6) 74)
	(= (time-to-drive s6 s11) 74)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s3)
	(at driver3 s2)
	(at driver4 s9)
	(at truck2 s11)
	(at truck3 s4)
	(at package1 s0)
	(at package2 s0)
	(at package3 s7)
	(at package4 s7)
	(at package5 s2)
	(at package6 s1)
	(at package7 s6)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 4  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver1 truck3 s11)
   deleted: (at driver1 s11) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 12
2. (drive-truck truck3 s11 s6 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s6)
   changed: (driven) from 0 to 74
   goals met: 3 of 12
3. (load-truck package1 truck3 s6)
   deleted: (at package1 s6)
   added: (in package1 truck3)
   goals met: 3 of 12
4. (walk driver2 s7 p3-7)
   deleted: (at driver2 s7)
   added: (at driver2 p3-7)
   changed: (walked) from 0 to 46
   goals met: 3 of 12
5. (walk driver2 p3-7 s3)
   deleted: (at driver2 p3-7)
   added: (at driver2 s3)
   changed: (walked) from 46 to 141
   goals met: 4 of 12
6. (drive-truck truck3 s6 s4 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (driven) from 74 to 122
   goals met: 5 of 12
7. (load-truck package2 truck3 s4)
   deleted: (at package2 s4)
   added: (in package2 truck3)
   goals met: 5 of 12
8. (drive-truck truck3 s4 s6 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   changed: (driven) from 122 to 170
   goals met: 4 of 12
9. (load-truck package5 truck3 s6)
   deleted: (at package5 s6)
   added: (in package5 truck3)
   goals met: 4 of 12
10. (drive-truck truck3 s6 s11 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s11)
   changed: (driven) from 170 to 244
   goals met: 4 of 12
11. (walk driver4 s7 p3-7)
   deleted: (at driver4 s7)
   added: (at driver4 p3-7)
   changed: (walked) from 141 to 187
   goals met: 4 of 12
12. (drive-truck truck3 s11 s6 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s6)
   changed: (driven) from 244 to 318
   goals met: 4 of 12
13. (walk driver4 p3-7 s3)
   deleted: (at driver4 p3-7)
   added: (at driver4 s3)
   changed: (walked) from 187 to 282
   goals met: 4 of 12
14. (walk driver4 s3 p9-3)
   deleted: (at driver4 s3)
   added: (at driver4 p9-3)
   changed: (walked) from 282 to 305
   goals met: 4 of 12
15. (walk driver4 p9-3 s9)
   deleted: (at driver4 p9-3)
   added: (at driver4 s9)
   changed: (walked) from 305 to 341
   goals met: 5 of 12
16. (drive-truck truck3 s6 s1 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   changed: (driven) from 318 to 390
   goals met: 5 of 12
17. (load-truck package4 truck3 s1)
   deleted: (at package4 s1)
   added: (in package4 truck3)
   goals met: 5 of 12
18. (drive-truck truck3 s1 s6 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s6)
   changed: (driven) from 390 to 462
   goals met: 5 of 12
19. (drive-truck truck3 s6 s4 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (driven) from 462 to 510
   goals met: 6 of 12
20. (drive-truck truck3 s4 s2 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (driven) from 510 to 546
   goals met: 5 of 12
21. (unload-truck package5 truck3 s2)
   deleted: (in package5 truck3)
   added: (at package5 s2)
   goals met: 6 of 12
22. (load-truck package7 truck3 s2)
   deleted: (at package7 s2)
   added: (in package7 truck3)
   goals met: 6 of 12
23. (walk driver3 s11 p0-11)
   deleted: (at driver3 s11)
   added: (at driver3 p0-11)
   changed: (walked) from 341 to 346
   goals met: 6 of 12
24. (walk driver3 p0-11 s0)
   deleted: (at driver3 p0-11)
   added: (at driver3 s0)
   changed: (walked) from 346 to 386
   goals met: 6 of 12
25. (walk driver3 s0 p0-2)
   deleted: (at driver3 s0)
   added: (at driver3 p0-2)
   changed: (walked) from 386 to 425
   goals met: 6 of 12
26. (walk driver3 p0-2 s2)
   deleted: (at driver3 p0-2)
   added: (at driver3 s2)
   changed: (walked) from 425 to 472
   goals met: 7 of 12
27. (drive-truck truck3 s2 s4 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (driven) from 546 to 582
   goals met: 8 of 12
28. (drive-truck truck3 s4 s6 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   changed: (driven) from 582 to 630
   goals met: 7 of 12
29. (unload-truck package7 truck3 s6)
   deleted: (in package7 truck3)
   added: (at package7 s6)
   goals met: 8 of 12
30. (drive-truck truck3 s6 s11 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s11)
   changed: (driven) from 630 to 704
   goals met: 8 of 12
31. (drive-truck truck3 s11 s0 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s0)
   changed: (driven) from 704 to 782
   goals met: 8 of 12
32. (unload-truck package1 truck3 s0)
   deleted: (in package1 truck3)
   added: (at package1 s0)
   goals met: 9 of 12
33. (unload-truck package2 truck3 s0)
   deleted: (in package2 truck3)
   added: (at package2 s0)
   goals met: 10 of 12
34. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 782 to 833
   goals met: 10 of 12
35. (drive-truck truck3 s2 s4 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (driven) from 833 to 869
   goals met: 11 of 12
36. (drive-truck truck3 s4 s7 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s7)
   changed: (driven) from 869 to 870
   goals met: 10 of 12
37. (unload-truck package4 truck3 s7)
   deleted: (in package4 truck3)
   added: (at package4 s7)
   goals met: 11 of 12
38. (drive-truck truck3 s7 s4 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   changed: (driven) from 870 to 871
   goals met: 12 of 12
